app/controllers/compares_controller.rb

  def index
    @compares = Compare.all
---
SELECT "compares".* FROM "compares"

  def create
    `cp #{params[:compare][:attachment].tempfile.path} D:/git/final_project/matlab/temp.png`
    Dir.chdir('/git/final_project/matlab')
    `matlab -nodesktop -wait  -r "compare_ver2('temp.png')";quit`
    output = File.read('myfile.txt')
    @compare = Compare.new(compare_params)
    @compare.user_id = session["user_id"]
    @compare.result = output.to_i
    if @compare.save
---
INSERT INTO "compares" ("name", "attachment", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "in ccompare"], ["attachment", "21_12_2016.pdf"], ["created_at", 2017-05-09 14:11:28 UTC], ["updated_at", 2017-05-09 14:11:28 UTC]]