app/controllers/counts_controller.rb

  def index
    @counts = Count.all
---
SELECT "counts".* FROM "counts"

  def create
    `cp #{params[:count][:attachment].tempfile.path} C:/Sites/final_project/matlab/count_temp`
    Dir.chdir('/Sites/final_project/matlab')
    `matlab -nodesktop -wait  -r "Count_Cells('count_temp')";quit`
    output = File.read('count_cell_result.txt')
    @count = Count.new(count_params)
    @count.user_id = session["user_id"]
    @count.result = output.to_i
    if @count.save
---
INSERT INTO "counts" ("name", "attachment", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "kk"], ["attachment", "______.DOC"], ["created_at", 2017-05-09 13:18:22 UTC], ["updated_at", 2017-05-09 13:18:22 UTC]]

  def destroy
    @count = Count.find(params[:id])
    @count.destroy
---
SELECT  "counts".* FROM "counts" WHERE "counts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "counts" WHERE "counts"."id" = ?  [["id", 1]]