app/controllers/dnas_controller.rb

SELECT "dnas".* FROM "dnas"
---
  def index
    @users = User.all
    @users.each do |user|
      @user_id = session["user_id"] if user.id == session["user_id"]
    end
    @dnas = Dna.all

INSERT INTO "dnas" ("name", "attachment", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "adad"], ["attachment", "Roi_Cohen_-CV.docx"], ["created_at", 2017-05-09 14:46:44 UTC], ["updated_at", 2017-05-09 14:46:44 UTC]]
---
  def create
    if valid_data(params[:dna][:attachment1].content_type) && valid_data(params[:dna][:attachment2].content_type)
      `cp #{params[:dna][:attachment1].tempfile.path} C:/Sites/final_project/matlab/red_temp`
      `cp #{params[:dna][:attachment2].tempfile.path} C:/Sites/final_project/matlab/blue_temp`

      Dir.chdir('/Sites/final_project/matlab')
      `matlab -nodesktop -wait  -r "red_compare_to_blue('red_temp', 'blue_temp')";quit`
      output = File.read('red&blue.txt')
      @dna = Dna.new(dna_params)
      result = []
      result = output.split(':')
      @dna.user_id = session["user_id"]
      @dna.ratio = result[0].to_f
      @dna.red = result[1].to_f
      @dna.blue = result[2].to_f
      if @dna.save